Revit 2024 API
IFCLevelInfo.GetBuildingStorey Method
 Gets the IfcBuildingStorey handle.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public IFCAnyHandle GetBuildingStorey()
Visual Basic
Public Function GetBuildingStorey As IFCAnyHandle
Visual C++
public:
IFCAnyHandle^ GetBuildingStorey()
Return Value
 The handle.
See Also
IFCLevelInfo Class
Autodesk.Revit.DB.IFC Namespace